---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.ConnectionInputPointInfo
source: html/fbe0dd8d-89d3-e0d1-f611-366e29034c40.htm
---
# ConnectionInputPointInfo Members

Construct a default input point.